<div class="w-full px-4 py-2 prose md:bg-white lg:py-4 lg:px-6 lg:rounded-2xl max-w-none">
  <p>Подробные правила акции <b class="text-lg">"Большие мешки"</b>, скидка <b
      class="text-xl text-red-400">-{{ $percent }}%</b></p>
  <ul>
    <li>К сухим кормам любого веса, составляющих в одном заказе в сумме <b>5 кг</b> или более, применяется скидка
      Большие мешки.
    </li>
    <li>Дисконтная карта <b>не применяется</b> при покупке товаров по данной акции.</li>
    <li>В акции могут учавствовать физические лица. Юридические лица и индивидуальные предприниматели не могут
      участвовать в акции.</li>
    <li>В акции участвуют товары из списка, определяемого Магазином «Зооподарки».</li>
    <li>Количество акционного товара ограничено. В случае реализации последней единицы товара, акция заканчивается.</li>
    <li>Обмен и возврат некачественных товаров, приобретенных по акции, осуществляются в общем порядке, предусмотренном
      действующим законодательством.</li>
    <li>Возврат денежных средств за товары, проданные по акции, осуществляется по цене, оплаченной покупателем.
      Стоимость, оплаченная покупателем за товар, указана в товарном чеке.</li>
    <li>Магазин «Зооподарки» имеет право в любой момент изменять сроки и условия ее проведения.</li>
  </ul>
</div>
